
-- -----------------------------------------------------
-- Заполнить категории
-- -----------------------------------------------------

CALL `add_category`('Кулинария');
CALL `add_category`('Здоровье');
CALL `add_category`('Базы данных');

-- -----------------------------------------------------
-- Заполнить статьи
-- -----------------------------------------------------

CALL `add_new_article`('Охота на поросят', '1', '1', 'Охота на красивых поросят', '../../img/no-img.jpg', 'Lorem...', 'Страшно красиво', '1');
CALL `add_new_article`('Охота на лук', '1', '1', 'Охота на красивый лук', '../../img/no-img.jpg', 'Lorem...', 'Страшно красиво', '1');
CALL `add_new_article`('Охота на капусту', '1', '1', 'Охота на красивую капусту', '../../img/no-img.jpg', 'Lorem...', 'Страшно красиво', '1');

CALL `add_new_article`('Здоровье поросят', '2', '1', 'Охота на здоровых поросят', '../../img/no-img.jpg', 'Lorem...', 'Как здорово!', '1');
CALL `add_new_article`('Здоровье капусты', '2', '1', 'Охота на здоровую капусту', '../../img/no-img.jpg', 'Lorem...', 'Как здорово!', '1');

CALL `add_new_article`('Здоровье поросята делают бд', '3', '1', 'Охота на здоровых поросят', '../../img/no-img.jpg', 'Lorem...', 'Как здорово!', '1');
CALL `add_new_article`('Из капусты в код', '2', '1', 'Охота на здоровую капусту', '../../img/no-img.jpg', 'Lorem...', 'Как здорово!', '1');

-- -----------------------------------------------------
-- Заполнить комментарии
-- -----------------------------------------------------

CALL `add_comment`('Классный суп получается', '1', '1');
CALL `add_comment`('Прошлый комментатор прав!', '1', '1');

-- -----------------------------------------------------
-- Заполнить пользователей
-- -----------------------------------------------------

CALL `add_new_user`('Никита', 'email@email.ru', '1234', 'Колташов', 'Никита Колташов', '../../img/avatars.jpg');
CALL `add_new_user`('Еще один Никита', 'email@email.ru', '1234', 'Колташов', 'Никита Колташов', '../../img/avatars.jpg');
CALL `add_new_user`('Еще еще один Никита', 'email@email.ru', '1234', 'Колташов', 'Никита Колташов', '../../img/avatars.jpg');
CALL `add_new_user`('Еще еще еще один Никита', 'email@email.ru', '1234', 'Колташов', 'Никита Колташов', '../../img/avatars.jpg');

-- -----------------------------------------------------
-- Заполнить паблики
-- -----------------------------------------------------

CALL `add_new_public`('Клуб любителей поросят', '1');
CALL `add_new_public`('Невероятный клуб любителей поросят', '1');

-- -----------------------------------------------------
-- Добавить статьи паблику
-- -----------------------------------------------------

CALL `subscribe_user_to_public`('1', '1');